flowforge/load-testing/results/baseline_k6.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/webhook_load.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 2m40s max duration (incl. graceful stop):
              * ramp: Up to 80 looping VUs for 2m30s over 2 stages (gracefulRampDown: 30s, gracefulStop: 10s)

time="2026-06-15T17:37:38Z" level=info msg="setup: workflow=7bbada59-efcf-4a1c-b5b5-e38072c91dd7 delayMs=150 webhookKey=CvWXjFI5..." source=console

running (0m00.9s), 01/80 VUs, 223 complete and 0 interrupted iterations
ramp   [   1% ] 01/80 VUs  0m00.8s/2m30.0s

running (0m01.9s), 02/80 VUs, 702 complete and 0 interrupted iterations
ramp   [   1% ] 02/80 VUs  0m01.8s/2m30.0s

running (0m02.9s), 02/80 VUs, 1236 complete and 0 interrupted iterations
ramp   [   2% ] 02/80 VUs  0m02.8s/2m30.0s

running (0m03.9s), 03/80 VUs, 1751 complete and 0 interrupted iterations
ramp   [   3% ] 03/80 VUs  0m03.8s/2m30.0s

running (0m04.9s), 04/80 VUs, 2287 complete and 0 interrupted iterations
ramp   [   3% ] 04/80 VUs  0m04.8s/2m30.0s

running (0m05.9s), 04/80 VUs, 2867 complete and 0 interrupted iterations
ramp   [   4% ] 04/80 VUs  0m05.8s/2m30.0s

running (0m06.9s), 05/80 VUs, 3551 complete and 0 interrupted iterations
ramp   [   5% ] 05/80 VUs  0m06.8s/2m30.0s

running (0m07.9s), 06/80 VUs, 4192 complete and 0 interrupted iterations
ramp   [   5% ] 06/80 VUs  0m07.8s/2m30.0s

running (0m08.9s), 06/80 VUs, 4927 complete and 0 interrupted iterations
ramp   [   6% ] 06/80 VUs  0m08.8s/2m30.0s

running (0m09.9s), 07/80 VUs, 5577 complete and 0 interrupted iterations
ramp   [   7% ] 07/80 VUs  0m09.8s/2m30.0s

running (0m10.9s), 08/80 VUs, 6189 complete and 0 interrupted iterations
ramp   [   7% ] 08/80 VUs  0m10.8s/2m30.0s

running (0m11.9s), 08/80 VUs, 6920 complete and 0 interrupted iterations
ramp   [   8% ] 08/80 VUs  0m11.8s/2m30.0s

running (0m12.9s), 09/80 VUs, 7617 complete and 0 interrupted iterations
ramp   [   9% ] 09/80 VUs  0m12.8s/2m30.0s

running (0m13.9s), 10/80 VUs, 8287 complete and 0 interrupted iterations
ramp   [   9% ] 10/80 VUs  0m13.8s/2m30.0s

running (0m14.9s), 10/80 VUs, 8855 complete and 0 interrupted iterations
ramp   [  10% ] 10/80 VUs  0m14.8s/2m30.0s

running (0m15.9s), 11/80 VUs, 9639 complete and 0 interrupted iterations
ramp   [  11% ] 11/80 VUs  0m15.8s/2m30.0s

running (0m16.9s), 12/80 VUs, 10383 complete and 0 interrupted iterations
ramp   [  11% ] 12/80 VUs  0m16.8s/2m30.0s

running (0m17.9s), 12/80 VUs, 11153 complete and 0 interrupted iterations
ramp   [  12% ] 12/80 VUs  0m17.8s/2m30.0s

running (0m18.9s), 13/80 VUs, 11910 complete and 0 interrupted iterations
ramp   [  13% ] 13/80 VUs  0m18.8s/2m30.0s

running (0m19.9s), 14/80 VUs, 12648 complete and 0 interrupted iterations
ramp   [  13% ] 14/80 VUs  0m19.8s/2m30.0s

running (0m20.9s), 14/80 VUs, 13114 complete and 0 interrupted iterations
ramp   [  14% ] 14/80 VUs  0m20.8s/2m30.0s

running (0m21.9s), 15/80 VUs, 13944 complete and 0 interrupted iterations
ramp   [  15% ] 15/80 VUs  0m21.8s/2m30.0s

running (0m22.9s), 16/80 VUs, 14615 complete and 0 interrupted iterations
ramp   [  15% ] 16/80 VUs  0m22.8s/2m30.0s

running (0m23.9s), 16/80 VUs, 15425 complete and 0 interrupted iterations
ramp   [  16% ] 16/80 VUs  0m23.8s/2m30.0s

running (0m24.9s), 17/80 VUs, 16042 complete and 0 interrupted iterations
ramp   [  17% ] 17/80 VUs  0m24.8s/2m30.0s

running (0m25.9s), 17/80 VUs, 16731 complete and 0 interrupted iterations
ramp   [  17% ] 17/80 VUs  0m25.8s/2m30.0s

running (0m26.9s), 18/80 VUs, 17532 complete and 0 interrupted iterations
ramp   [  18% ] 18/80 VUs  0m26.8s/2m30.0s

running (0m27.9s), 19/80 VUs, 18203 complete and 0 interrupted iterations
ramp   [  19% ] 19/80 VUs  0m27.8s/2m30.0s

running (0m28.9s), 19/80 VUs, 18937 complete and 0 interrupted iterations
ramp   [  19% ] 19/80 VUs  0m28.8s/2m30.0s

running (0m29.9s), 20/80 VUs, 19589 complete and 0 interrupted iterations
ramp   [  20% ] 20/80 VUs  0m29.8s/2m30.0s

running (0m30.9s), 21/80 VUs, 20221 complete and 0 interrupted iterations
ramp   [  21% ] 21/80 VUs  0m30.8s/2m30.0s

running (0m31.9s), 21/80 VUs, 20950 complete and 0 interrupted iterations
ramp   [  21% ] 21/80 VUs  0m31.8s/2m30.0s

running (0m32.9s), 22/80 VUs, 21683 complete and 0 interrupted iterations
ramp   [  22% ] 22/80 VUs  0m32.8s/2m30.0s

running (0m33.9s), 23/80 VUs, 22417 complete and 0 interrupted iterations
ramp   [  23% ] 23/80 VUs  0m33.8s/2m30.0s

running (0m34.9s), 23/80 VUs, 23045 complete and 0 interrupted iterations
ramp   [  23% ] 23/80 VUs  0m34.8s/2m30.0s

running (0m35.9s), 24/80 VUs, 23677 complete and 0 interrupted iterations
ramp   [  24% ] 24/80 VUs  0m35.8s/2m30.0s

running (0m36.9s), 25/80 VUs, 24517 complete and 0 interrupted iterations
ramp   [  25% ] 25/80 VUs  0m36.8s/2m30.0s

running (0m37.9s), 25/80 VUs, 25159 complete and 0 interrupted iterations
ramp   [  25% ] 25/80 VUs  0m37.8s/2m30.0s

running (0m38.9s), 26/80 VUs, 25913 complete and 0 interrupted iterations
ramp   [  26% ] 26/80 VUs  0m38.8s/2m30.0s

running (0m39.9s), 27/80 VUs, 26606 complete and 0 interrupted iterations
ramp   [  27% ] 27/80 VUs  0m39.8s/2m30.0s

running (0m40.9s), 27/80 VUs, 27270 complete and 0 interrupted iterations
ramp   [  27% ] 27/80 VUs  0m40.8s/2m30.0s

running (0m41.9s), 28/80 VUs, 27938 complete and 0 interrupted iterations
ramp   [  28% ] 28/80 VUs  0m41.8s/2m30.0s

running (0m42.9s), 29/80 VUs, 28658 complete and 0 interrupted iterations
ramp   [  29% ] 29/80 VUs  0m42.8s/2m30.0s

running (0m43.9s), 29/80 VUs, 29488 complete and 0 interrupted iterations
ramp   [  29% ] 29/80 VUs  0m43.8s/2m30.0s

running (0m44.9s), 30/80 VUs, 30112 complete and 0 interrupted iterations
ramp   [  30% ] 30/80 VUs  0m44.8s/2m30.0s

running (0m45.9s), 31/80 VUs, 30838 complete and 0 interrupted iterations
ramp   [  31% ] 31/80 VUs  0m45.8s/2m30.0s

running (0m46.9s), 31/80 VUs, 31532 complete and 0 interrupted iterations
ramp   [  31% ] 31/80 VUs  0m46.8s/2m30.0s

running (0m47.9s), 32/80 VUs, 32275 complete and 0 interrupted iterations
ramp   [  32% ] 32/80 VUs  0m47.8s/2m30.0s

running (0m48.9s), 33/80 VUs, 33043 complete and 0 interrupted iterations
ramp   [  33% ] 33/80 VUs  0m48.8s/2m30.0s

running (0m49.9s), 33/80 VUs, 33822 complete and 0 interrupted iterations
ramp   [  33% ] 33/80 VUs  0m49.8s/2m30.0s

running (0m50.9s), 34/80 VUs, 34462 complete and 0 interrupted iterations
ramp   [  34% ] 34/80 VUs  0m50.8s/2m30.0s

running (0m51.9s), 35/80 VUs, 35115 complete and 0 interrupted iterations
ramp   [  35% ] 35/80 VUs  0m51.8s/2m30.0s

running (0m52.9s), 35/80 VUs, 35884 complete and 0 interrupted iterations
ramp   [  35% ] 35/80 VUs  0m52.8s/2m30.0s

running (0m53.9s), 36/80 VUs, 36639 complete and 0 interrupted iterations
ramp   [  36% ] 36/80 VUs  0m53.8s/2m30.0s

running (0m54.9s), 37/80 VUs, 37266 complete and 0 interrupted iterations
ramp   [  37% ] 37/80 VUs  0m54.8s/2m30.0s

running (0m55.9s), 37/80 VUs, 37996 complete and 0 interrupted iterations
ramp   [  37% ] 37/80 VUs  0m55.8s/2m30.0s

running (0m56.9s), 38/80 VUs, 38804 complete and 0 interrupted iterations
ramp   [  38% ] 38/80 VUs  0m56.8s/2m30.0s

running (0m57.9s), 39/80 VUs, 39328 complete and 0 interrupted iterations
ramp   [  39% ] 39/80 VUs  0m57.8s/2m30.0s

running (0m58.9s), 39/80 VUs, 40077 complete and 0 interrupted iterations
ramp   [  39% ] 39/80 VUs  0m58.8s/2m30.0s

running (0m59.9s), 40/80 VUs, 40732 complete and 0 interrupted iterations
ramp   [  40% ] 40/80 VUs  0m59.8s/2m30.0s

running (1m00.9s), 41/80 VUs, 41401 complete and 0 interrupted iterations
ramp   [  41% ] 41/80 VUs  1m00.8s/2m30.0s

running (1m01.9s), 41/80 VUs, 41991 complete and 0 interrupted iterations
ramp   [  41% ] 41/80 VUs  1m01.8s/2m30.0s

running (1m02.9s), 42/80 VUs, 42743 complete and 0 interrupted iterations
ramp   [  42% ] 42/80 VUs  1m02.8s/2m30.0s

running (1m03.9s), 43/80 VUs, 43532 complete and 0 interrupted iterations
ramp   [  43% ] 43/80 VUs  1m03.8s/2m30.0s

running (1m04.9s), 43/80 VUs, 44183 complete and 0 interrupted iterations
ramp   [  43% ] 43/80 VUs  1m04.8s/2m30.0s

running (1m05.9s), 44/80 VUs, 44857 complete and 0 interrupted iterations
ramp   [  44% ] 44/80 VUs  1m05.8s/2m30.0s

running (1m06.9s), 44/80 VUs, 45675 complete and 0 interrupted iterations
ramp   [  45% ] 44/80 VUs  1m06.8s/2m30.0s

running (1m07.9s), 45/80 VUs, 46384 complete and 0 interrupted iterations
ramp   [  45% ] 45/80 VUs  1m07.8s/2m30.0s

running (1m08.9s), 46/80 VUs, 47151 complete and 0 interrupted iterations
ramp   [  46% ] 46/80 VUs  1m08.8s/2m30.0s

running (1m09.9s), 46/80 VUs, 47902 complete and 0 interrupted iterations
ramp   [  47% ] 46/80 VUs  1m09.8s/2m30.0s

running (1m10.9s), 47/80 VUs, 48574 complete and 0 interrupted iterations
ramp   [  47% ] 47/80 VUs  1m10.8s/2m30.0s

running (1m11.9s), 48/80 VUs, 49355 complete and 0 interrupted iterations
ramp   [  48% ] 48/80 VUs  1m11.8s/2m30.0s

running (1m12.9s), 48/80 VUs, 49925 complete and 0 interrupted iterations
ramp   [  49% ] 48/80 VUs  1m12.8s/2m30.0s

running (1m13.9s), 49/80 VUs, 50722 complete and 0 interrupted iterations
ramp   [  49% ] 49/80 VUs  1m13.8s/2m30.0s

running (1m14.9s), 50/80 VUs, 51374 complete and 0 interrupted iterations
ramp   [  50% ] 50/80 VUs  1m14.8s/2m30.0s

running (1m15.9s), 50/80 VUs, 52030 complete and 0 interrupted iterations
ramp   [  51% ] 50/80 VUs  1m15.8s/2m30.0s

running (1m16.9s), 51/80 VUs, 52723 complete and 0 interrupted iterations
ramp   [  51% ] 51/80 VUs  1m16.8s/2m30.0s

running (1m17.9s), 52/80 VUs, 53527 complete and 0 interrupted iterations
ramp   [  52% ] 52/80 VUs  1m17.8s/2m30.0s

running (1m18.9s), 52/80 VUs, 54238 complete and 0 interrupted iterations
ramp   [  53% ] 52/80 VUs  1m18.8s/2m30.0s

running (1m19.9s), 53/80 VUs, 54951 complete and 0 interrupted iterations
ramp   [  53% ] 53/80 VUs  1m19.8s/2m30.0s

running (1m20.9s), 54/80 VUs, 55660 complete and 0 interrupted iterations
ramp   [  54% ] 54/80 VUs  1m20.8s/2m30.0s

running (1m21.9s), 54/80 VUs, 56419 complete and 0 interrupted iterations
ramp   [  55% ] 54/80 VUs  1m21.8s/2m30.0s

running (1m22.9s), 55/80 VUs, 57061 complete and 0 interrupted iterations
ramp   [  55% ] 55/80 VUs  1m22.8s/2m30.0s

running (1m23.9s), 56/80 VUs, 57771 complete and 0 interrupted iterations
ramp   [  56% ] 56/80 VUs  1m23.8s/2m30.0s

running (1m24.9s), 56/80 VUs, 58473 complete and 0 interrupted iterations
ramp   [  57% ] 56/80 VUs  1m24.8s/2m30.0s

running (1m25.9s), 57/80 VUs, 59165 complete and 0 interrupted iterations
ramp   [  57% ] 57/80 VUs  1m25.8s/2m30.0s

running (1m26.9s), 58/80 VUs, 59939 complete and 0 interrupted iterations
ramp   [  58% ] 58/80 VUs  1m26.8s/2m30.0s

running (1m27.9s), 58/80 VUs, 60671 complete and 0 interrupted iterations
ramp   [  59% ] 58/80 VUs  1m27.8s/2m30.0s

running (1m28.9s), 59/80 VUs, 61470 complete and 0 interrupted iterations
ramp   [  59% ] 59/80 VUs  1m28.8s/2m30.0s

running (1m29.9s), 60/80 VUs, 62158 complete and 0 interrupted iterations
ramp   [  60% ] 60/80 VUs  1m29.8s/2m30.0s

running (1m30.9s), 60/80 VUs, 62817 complete and 0 interrupted iterations
ramp   [  61% ] 60/80 VUs  1m30.8s/2m30.0s

running (1m31.9s), 61/80 VUs, 63572 complete and 0 interrupted iterations
ramp   [  61% ] 61/80 VUs  1m31.8s/2m30.0s

running (1m32.9s), 62/80 VUs, 64244 complete and 0 interrupted iterations
ramp   [  62% ] 62/80 VUs  1m32.8s/2m30.0s

running (1m33.9s), 62/80 VUs, 64905 complete and 0 interrupted iterations
ramp   [  63% ] 62/80 VUs  1m33.8s/2m30.0s

running (1m34.9s), 63/80 VUs, 65581 complete and 0 interrupted iterations
ramp   [  63% ] 63/80 VUs  1m34.8s/2m30.0s

running (1m35.9s), 64/80 VUs, 66306 complete and 0 interrupted iterations
ramp   [  64% ] 64/80 VUs  1m35.8s/2m30.0s

running (1m36.9s), 64/80 VUs, 67054 complete and 0 interrupted iterations
ramp   [  65% ] 64/80 VUs  1m36.8s/2m30.0s

running (1m37.9s), 65/80 VUs, 67836 complete and 0 interrupted iterations
ramp   [  65% ] 65/80 VUs  1m37.8s/2m30.0s

running (1m38.9s), 66/80 VUs, 68555 complete and 0 interrupted iterations
ramp   [  66% ] 66/80 VUs  1m38.8s/2m30.0s

running (1m39.9s), 66/80 VUs, 69234 complete and 0 interrupted iterations
ramp   [  67% ] 66/80 VUs  1m39.8s/2m30.0s

running (1m40.9s), 67/80 VUs, 69853 complete and 0 interrupted iterations
ramp   [  67% ] 67/80 VUs  1m40.8s/2m30.0s

running (1m41.9s), 68/80 VUs, 70644 complete and 0 interrupted iterations
ramp   [  68% ] 68/80 VUs  1m41.8s/2m30.0s

running (1m42.9s), 68/80 VUs, 71357 complete and 0 interrupted iterations
ramp   [  69% ] 68/80 VUs  1m42.8s/2m30.0s

running (1m43.9s), 69/80 VUs, 71934 complete and 0 interrupted iterations
ramp   [  69% ] 69/80 VUs  1m43.8s/2m30.0s

running (1m44.9s), 69/80 VUs, 72545 complete and 0 interrupted iterations
ramp   [  70% ] 69/80 VUs  1m44.8s/2m30.0s

running (1m46.0s), 70/80 VUs, 73236 complete and 0 interrupted iterations
ramp   [  71% ] 70/80 VUs  1m45.8s/2m30.0s

running (1m46.9s), 71/80 VUs, 73936 complete and 0 interrupted iterations
ramp   [  71% ] 71/80 VUs  1m46.8s/2m30.0s

running (1m47.9s), 71/80 VUs, 74671 complete and 0 interrupted iterations
ramp   [  72% ] 71/80 VUs  1m47.8s/2m30.0s

running (1m48.9s), 72/80 VUs, 75349 complete and 0 interrupted iterations
ramp   [  73% ] 72/80 VUs  1m48.8s/2m30.0s

running (1m49.9s), 73/80 VUs, 75996 complete and 0 interrupted iterations
ramp   [  73% ] 73/80 VUs  1m49.8s/2m30.0s

running (1m50.9s), 73/80 VUs, 76704 complete and 0 interrupted iterations
ramp   [  74% ] 73/80 VUs  1m50.8s/2m30.0s

running (1m52.0s), 74/80 VUs, 77449 complete and 0 interrupted iterations
ramp   [  75% ] 74/80 VUs  1m51.8s/2m30.0s

running (1m52.9s), 75/80 VUs, 78180 complete and 0 interrupted iterations
ramp   [  75% ] 75/80 VUs  1m52.8s/2m30.0s

running (1m53.9s), 75/80 VUs, 78701 complete and 0 interrupted iterations
ramp   [  76% ] 75/80 VUs  1m53.8s/2m30.0s

running (1m54.9s), 76/80 VUs, 79377 complete and 0 interrupted iterations
ramp   [  77% ] 76/80 VUs  1m54.8s/2m30.0s

running (1m55.9s), 77/80 VUs, 79955 complete and 0 interrupted iterations
ramp   [  77% ] 77/80 VUs  1m55.8s/2m30.0s

running (1m56.9s), 77/80 VUs, 80771 complete and 0 interrupted iterations
ramp   [  78% ] 77/80 VUs  1m56.8s/2m30.0s

running (1m57.9s), 78/80 VUs, 81435 complete and 0 interrupted iterations
ramp   [  79% ] 78/80 VUs  1m57.8s/2m30.0s

running (1m58.9s), 79/80 VUs, 81814 complete and 0 interrupted iterations
ramp   [  79% ] 79/80 VUs  1m58.8s/2m30.0s

running (1m59.9s), 79/80 VUs, 82442 complete and 0 interrupted iterations
ramp   [  80% ] 79/80 VUs  1m59.8s/2m30.0s

running (2m00.9s), 80/80 VUs, 83084 complete and 0 interrupted iterations
ramp   [  81% ] 80/80 VUs  2m00.8s/2m30.0s

running (2m01.9s), 80/80 VUs, 83867 complete and 0 interrupted iterations
ramp   [  81% ] 80/80 VUs  2m01.8s/2m30.0s

running (2m02.9s), 80/80 VUs, 84534 complete and 0 interrupted iterations
ramp   [  82% ] 80/80 VUs  2m02.8s/2m30.0s

running (2m03.9s), 80/80 VUs, 85213 complete and 0 interrupted iterations
ramp   [  83% ] 80/80 VUs  2m03.8s/2m30.0s

running (2m04.9s), 80/80 VUs, 85812 complete and 0 interrupted iterations
ramp   [  83% ] 80/80 VUs  2m04.8s/2m30.0s

running (2m05.9s), 80/80 VUs, 86556 complete and 0 interrupted iterations
ramp   [  84% ] 80/80 VUs  2m05.8s/2m30.0s

running (2m06.9s), 80/80 VUs, 87172 complete and 0 interrupted iterations
ramp   [  85% ] 80/80 VUs  2m06.8s/2m30.0s

running (2m07.9s), 80/80 VUs, 87938 complete and 0 interrupted iterations
ramp   [  85% ] 80/80 VUs  2m07.8s/2m30.0s

running (2m08.9s), 80/80 VUs, 88728 complete and 0 interrupted iterations
ramp   [  86% ] 80/80 VUs  2m08.8s/2m30.0s

running (2m09.9s), 80/80 VUs, 89398 complete and 0 interrupted iterations
ramp   [  87% ] 80/80 VUs  2m09.8s/2m30.0s

running (2m10.9s), 80/80 VUs, 90035 complete and 0 interrupted iterations
ramp   [  87% ] 80/80 VUs  2m10.8s/2m30.0s

running (2m11.9s), 80/80 VUs, 90751 complete and 0 interrupted iterations
ramp   [  88% ] 80/80 VUs  2m11.8s/2m30.0s

running (2m12.9s), 80/80 VUs, 91492 complete and 0 interrupted iterations
ramp   [  89% ] 80/80 VUs  2m12.8s/2m30.0s

running (2m13.9s), 80/80 VUs, 92180 complete and 0 interrupted iterations
ramp   [  89% ] 80/80 VUs  2m13.8s/2m30.0s

running (2m14.9s), 80/80 VUs, 92733 complete and 0 interrupted iterations
ramp   [  90% ] 80/80 VUs  2m14.8s/2m30.0s

running (2m15.9s), 80/80 VUs, 93403 complete and 0 interrupted iterations
ramp   [  91% ] 80/80 VUs  2m15.8s/2m30.0s

running (2m16.9s), 80/80 VUs, 94201 complete and 0 interrupted iterations
ramp   [  91% ] 80/80 VUs  2m16.8s/2m30.0s

running (2m17.9s), 80/80 VUs, 94878 complete and 0 interrupted iterations
ramp   [  92% ] 80/80 VUs  2m17.8s/2m30.0s

running (2m18.9s), 80/80 VUs, 95672 complete and 0 interrupted iterations
ramp   [  93% ] 80/80 VUs  2m18.8s/2m30.0s

running (2m19.9s), 80/80 VUs, 96259 complete and 0 interrupted iterations
ramp   [  93% ] 80/80 VUs  2m19.8s/2m30.0s

running (2m20.9s), 80/80 VUs, 96973 complete and 0 interrupted iterations
ramp   [  94% ] 80/80 VUs  2m20.8s/2m30.0s

running (2m21.9s), 80/80 VUs, 97687 complete and 0 interrupted iterations
ramp   [  95% ] 80/80 VUs  2m21.8s/2m30.0s

running (2m22.9s), 80/80 VUs, 98443 complete and 0 interrupted iterations
ramp   [  95% ] 80/80 VUs  2m22.8s/2m30.0s

running (2m23.9s), 80/80 VUs, 99076 complete and 0 interrupted iterations
ramp   [  96% ] 80/80 VUs  2m23.8s/2m30.0s

running (2m24.9s), 80/80 VUs, 99316 complete and 0 interrupted iterations
ramp   [  97% ] 80/80 VUs  2m24.8s/2m30.0s

running (2m25.9s), 80/80 VUs, 100103 complete and 0 interrupted iterations
ramp   [  97% ] 80/80 VUs  2m25.8s/2m30.0s

running (2m26.9s), 80/80 VUs, 100808 complete and 0 interrupted iterations
ramp   [  98% ] 80/80 VUs  2m26.8s/2m30.0s

running (2m27.9s), 80/80 VUs, 101536 complete and 0 interrupted iterations
ramp   [  99% ] 80/80 VUs  2m27.8s/2m30.0s

running (2m28.9s), 80/80 VUs, 102211 complete and 0 interrupted iterations
ramp   [  99% ] 80/80 VUs  2m28.8s/2m30.0s

running (2m29.9s), 80/80 VUs, 102841 complete and 0 interrupted iterations
ramp   [ 100% ] 80/80 VUs  2m29.8s/2m30.0s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<1.0' rate=0.00%

    webhook_trigger_ms
    ✓ 'p(95)<60000' p(95)=173.84ms


  █ TOTAL RESULTS 

    checks_total.......: 206202  1372.140361/s
    checks_succeeded...: 100.00% 206202 out of 206202
    checks_failed......: 0.00%   0 out of 206202

    ✓ register 201
    ✓ workflow 201
    ✓ graph 200
    ✓ webhook 201
    ✓ accepted 202
    ✓ not 5xx

    CUSTOM
    webhook_accepted_202...........: 103099 686.056872/s
    webhook_trigger_ms.............: avg=69.49ms min=1.05ms med=54.64ms max=531.91ms p(90)=154.16ms p(95)=173.84ms

    HTTP
    http_req_duration..............: avg=69.49ms min=1.05ms med=54.63ms max=531.91ms p(90)=154.16ms p(95)=173.84ms
      { expected_response:true }...: avg=69.49ms min=1.05ms med=54.63ms max=531.91ms p(90)=154.16ms p(95)=173.84ms
    http_req_failed................: 0.00%  0 out of 103104
    http_reqs......................: 103104 686.090144/s

    EXECUTION
    iteration_duration.............: avg=69.84ms min=1.13ms med=55ms    max=532ms    p(90)=154.5ms  p(95)=174.3ms 
    iterations.....................: 103099 686.056872/s
    vus............................: 80     min=1           max=80
    vus_max........................: 80     min=80          max=80

    NETWORK
    data_received..................: 73 MB  486 kB/s
    data_sent......................: 20 MB  132 kB/s



running (2m30.3s), 00/80 VUs, 103099 complete and 0 interrupted iterations
ramp ✓ [ 100% ] 00/80 VUs  2m30s